//=============================================================================
// FNG_Composition.js
//=============================================================================

/*:
  * @target MZ
  * @plugindesc アイテム合成シーン
  * @author finga
  * @help アイテム合成シーン
*/

Game_Party.prototype.compositionRecipe = function(){
    return[
        //--------アイテム----------------------------------------
        ["I",3, //エクスポーション
            ["I",109,20],//いやしのみず
        ],
        ["I",4, //メガポーション
            ["I",110,5],//せいめいのいずみ
        ],
        ["I",5, //エーテル
            ["I",90,10],//まりょくのつぶ
        ],
        ["I",6, //エーテルドライ
            ["I",91,10],//ませきのかけら
        ],
        ["I",7, //エーテルターボ
            ["I",92,10],//まどうせき
        ],
        ["I",8, //エリクサー
            ["I",94,3],//けんじゃのいし
        ],
        ["I",9, //ラストエリクサー
            ["I",94,20],//けんじゃのいし
        ],
        ["I",19, //フェニックスのはね
            ["I",102,1],//せいよくしょう
        ],
        ["I",20, //メガフェニックス
            ["I",102,5],//せいよくしょう
        ],
         ["I",54, //きんのすなどけい
            ["I",48,5],//ほしのすな
            ["I",83,1],//きんのかたまり
        ],["I",239, //しゅりけん×10
            ["I",82,1],//てつのかたまり
        ],["I",240, //ふうましゅりけん×3
            ["I",84,1],//ダマスカスこう
        ],["I",62, //かざぐるま
            ["I",44,1],//かぜきりば
            ["W",66,1],//むらさめ
        ],["I",67, //このはがくれ
            ["I",105,1], //ハガクレのまるた
        ],["I",68, //ほうちょう
            ["I",86,1], //たまはがね
            ["W",67,1], //かげぬい
        //--------白魔法----------------------------------------
        ],["I",121, //ケアルラ
            ["I",109,1], //いやしのみず
            ["I",90,3], //まりょくのつぶ
        ],["I",122, //ケアルダ
            ["I",110,1], //せいめいのいずみ
            ["I",91,3], //ませきのかけら
        ],["I",123, //ケアルガ
            ["I",111,1], //かぜのささやき
            ["I",92,1], //まどうせき
        ],["I",124, //ヒール
            ["I",121,1], //ケアルラ
            ["I",4,1], //メガポーション
        ],["I",125, //ヒーラ
            ["I",123,1], //ケアルガ
            ["I",19,1], //フェニックスのはね
        ],["I",129, //エスナ
            ["I",21,20], //ばんのうやく
            ["I",91,1], //ませきのかけら
        ],["I",130, //レイズ
            ["I",18,20], //フェニックスの尾
            ["I",90,3], //まりょくのつぶ
        ],["I",131, //アレイズ
            ["I",110,5], //せいめいのいずみ
            ["I",19,1], //フェニックスのはね
            ["I",92,3], //まどうせき
        ],["I",133, //シェル
            ["I",34,1], //かめのこうら
            ["I",167,1], //ウォータ
        ],["I",134, //プロテス
            ["I",82,1], //てつのかたまり
            ["I",155,1], //ファイア
        ],["I",135, //バーサク
            ["I",142,1], //コンフュ
            ["I",37,1], //つきのカーテン
        ],["I",136, //リレイズ
            ["I",130,1], //レイズ
            ["I",211,1], //レビテト
            ["I",20,1], //メガフェニックス
            ["I",102,1], //せいよくしょう
        ],["I",137, //バファイ
            ["I",133,1], //シェル
            ["I",156,1], //ファイラ
        ],["I",138, //バサンダ
            ["I",133,1], //シェル
            ["I",164,1], //サンダラ
        ],["I",139, //バコルド
            ["I",133,1], //シェル
            ["I",160,1], //ブリザラ
        ],["I",140, //バウォタ
            ["I",133,1], //シェル
            ["I",168,1], //ウォタラ
        ],["I",141, //バエアロ
            ["I",133,1], //シェル
            ["I",148,1], //エアロラ
        ],["I",143, //サイレス
            ["I",118,2], //ちんもくのこな
            ["I",90,1], //まりょくのつぶ
        ],["I",145, //ミニマム
            ["I",213,1], //グラビデ
            ["I",144,1], //ホールド
        ],["I",147, //エアロ
            ["I",112,1], //だいちょうのはね
            ["I",90,1], //まりょくのつぶ
        ],["I",148, //エアロラ
            ["I",31,3], //なんきょくのかぜ
            ["I",42,1], //ほっきょくのかぜ
        ],["I",149, //エアロガ
            ["I",44,1], //かぜきりば
            ["I",92,1], //まどうせき
        ],["I",150, //エアロジャ
            ["I",149,1], //エアロガ
            ["I",94,1], //けんじゃのいし
        ],["I",151, //ホーリー
            ["I",51,3], //ホーリーストーン
            ["I",102,1], //せいよくしょう
            ["I",94,1], //けんじゃのいし
        //--------黒魔法----------------------------------------
        ],["I",156, //ファイラ
            ["I",30,3], //ボムのかけら
            ["I",91,1], //ませきのかけら
        ],["I",157, //ファイガ
            ["I",40,1], //かりゅうのきば
            ["I",92,1], //まどうせき
        ],["I",158, //ファイジャ
            ["I",157,1], //ファイガ
            ["I",93,1], //ロゼッタいし
        ],["I",160, //ブリザラ
            ["I",31,3], //なんきょくのかぜ
            ["I",91,1], //ませきのかけら
        ],["I",161, //ブリザガ
            ["I",42,1], //ほっきょくのかぜ
            ["I",92,1], //まどうせき
        ],["I",162, //ブリザジャ
            ["I",161,1], //ブリザガ
            ["I",93,1], //ロゼッタいし
        ],["I",164, //サンダラ
            ["I",32,3], //サンゴのかけら
            ["I",91,1], //ませきのかけら
        ],["I",165, //サンダガ
            ["I",41,1], //でんげきちょうのつの
            ["I",92,1], //まどうせき
        ],["I",166, //サンダジャ
            ["I",165,1], //サンダガ
            ["I",93,1], //ロゼッタいし
        ],["I",168, //ウォタラ
            ["I",33,3], //みずのけっしょう
            ["I",91,1], //ませきのかけら
        ],["I",169, //ウォタガ
            ["I",43,1], //アクアマリン
            ["I",92,1], //まどうせき
        ],["I",170, //ウォタジャ
            ["I",169,1], //ウォタガ
            ["I",93,1], //ロゼッタいし
        ],["I",171, //バイオ
            ["I",47,1], //モルボルのしょくしゅ
            ["I",46,1], //ゆうがいぶっしつ
            ["I",91,2], //ませきのかけら
        ],["I",172, //ダーク
            ["I",98,1], //のろいのつめ
            ["I",101,1], //アーリマンのはね
            ["I",91,1], //ませきのかけら            
        ],["I",173, //ルイン
            ["I",155,1], //ファイア
            ["I",159,1], //ブリザド
            ["I",163,1], //サンダー
            ["I",167,1], //ウォータ
        ],["I",174, //ルインラ
            ["I",156,1], //ファイラ
            ["I",160,1], //ブリザラ
            ["I",164,1], //サンダラ
            ["I",168,1], //ウォタラ
        ],["I",188, //ルインガ
            ["I",91,5], //ませきのかけら
            ["I",92,3], //まどうせき
        ],["I",175, //フレア
            ["I",103,1], //エネルギー結晶
            ["I",50,3], //フレアストーン
            ["I",93,1], //ロゼッタいし
        ],["I",177, //ドレイン
            ["I",113,5], //きゅうけつのきば
            ["I",91,1], //ませきのかけら
        ],["I",178, //アスピル
            ["I",179,1], //ラスピル
            ["I",177,1], //ドレイン
            ["I",92,1], //まどうせき
        ],["I",179, //ラスピル
            ["I",113,1], //エーテルターボ
            ["I",34,1], //かめのこうら
            ["I",91,1], //ませきのかけら
        ],["I",180, //ポイズン
            ["I",114,5], //どくのこな
            ["I",90,1], //まりょくのつぶ
        ],["I",181, //スリプル
            ["I",108,5], //ねむりごな
            ["I",90,1], //まりょくのつぶ
        ],["I",182, //パライズ
            ["I",32,1], //サンゴのかけら
            ["I",90,1], //まりょくのつぶ
        ],["I",183, //ブライン
            ["I",115,1], //オチューのしょくしゅ
            ["I",90,1], //まりょくのつぶ
        ],["I",184, //トード
            ["I",33,1], //みずのけっしょう
            ["I",14,10], //おとめのキッス
            ["I",90,1], //まりょくのつぶ
        ],["I",185, //ブレイク
            ["I",45,1], //だいちのドラム
            ["I",104,5], //きょうりゅうのほね
            ["I",92,1], //まどうせき
        ],["I",186, //デス
            ["I",172,1], //ダーク
            ["I",99,6], //サレコウベ
            ["I",92,1], //まどうせき
        //--------時空----------------------------------------
        ],["I",199, //ヘイスト
            ["I",116,1], //ウサギのしっぽ
            ["I",34,1], //カメのこうら
            ["I",92,1], //まどうせき
        ],["I",200, //ヘイスガ
            ["I",199,1], //ヘイスト
            ["I",202,1], //スロウガ
            ["I",107,1], //ときのはぐるま
        ],["I",202, //スロウガ
            ["I",201,1], //スロウ
            ["I",214,1], //グラビガ
        ],["I",203, //クイック
            ["I",54,3], //きんのすなどけい
            ["I",107,1], //ときのはぐるま
        ],["I",205, //ラピッド
            ["I",116,1], //ヘイスト
            ["I",93,1], //ロゼッタいし
            ["I",107,1], //ときのはぐるま
        ],["I",207, //ブリンク
            ["I",66,5], //かげぶんしん
            ["I",90,1], //まりょくのつぶ
        ],["I",208, //バニシュ
            ["I",67,5], //このはがくれ
            ["I",90,1], //まりょくのつぶ
        ],["I",209, //リフレク
            ["I",95,1], //ルビー
            ["I",90,5], //まりょくのつぶ   
            ["I",38,2], //ひかりのカーテン        
        ],["I",210, //リジェネ
            ["I",120,1], //ケアル
            ["I",201,1], //スロウ
        ],["I",211, //レビテト
            ["A",191,1], //てんしのはね
            ["I",213,1], //グラビデ
        ],["I",212, //ストップ
            ["I",144,1], //ホールド
            ["I",182,1], //パライズ
            ["I",201,1], //スロウ
        ],["I",213, //グラビデ
            ["I",134,1], //プロテス
            ["I",90,1], //まりょくのつぶ
        ],["I",214, //グラビガ
            ["I",213,1], //グラビデ
            ["I",48,3], //ほしのすな
        ],["I",215, //グラビジャ
            ["I",214,1], //グラビガ
            ["I",93,1], //ロゼッタいし
        ],["I",216, //デジョン
            ["I",36,1], //ダークマター
            ["I",92,1], //まどうせき
        ],["I",217, //コメット
            ["I",48,1], //ほしのすな
            ["I",91,1], //ませきのかけら
        ],["I",218, //メテオ
            ["I",214,1], //グラビガ
            ["I",217,1], //コメット
            ["I",36,2], //ダークマター
            ["I",93,1], //ロゼッタいし
        //--------剣----------------------------------------
        ],["W",4, //アイアンソード
            ["I",82,1], //鉄の塊
        ],["W",5, //こだいのつるぎ
            ["W",14,1], //ミスリルソード
            ["I",108,3], //ねむりごな
        ],["W",6, //ルーンブレイド
            ["I",84,1], //ダマスカスこう
        ],["W",8, //ソーサルセイバー
            ["W",4,1], //アイアンソード
            ["W",200,1], //まどうしのロッド
        ],["W",9, //サラマンドソード
            ["W",14,1], //ミスリルソード
            ["I",30,3], //ボムのかけら
        ],["W",10, //アイスブランド
            ["W",14,1], //ミスリルソード
            ["I",31,3], //なんきょくのかぜ
        ],["W",11, //さんごのつるぎ
            ["W",14,1], //ミスリルソード
            ["I",32,3], //サンゴのかけら
        ],["W",12, //フラタニティ・改
            ["W",7,1], //フラタニティ
            ["I",33,3], //みずのけっしょう
        ],["W",13, //ブレイクブレイド
            ["W",14,1], //ミスリルソード
            ["I",45,1], //だいちのドラム
        ],["W",14, //ミスリルソード
            ["I",85,1], //ミスリル
        ],["W",15, //ブラッドソード
            ["W",14,1], //ミスリルソード
            ["I",113,5], //きゅうけつのきば
            ["I",98,3], //のろいのつめ
        ],["W",16, //フォースセイバー
            ["W",8,1], //ソーサルセイバー
            ["W",190,1], //さばきのつえ
        ],["W",17, //エンハンスソード
            ["W",34,1], //ひかりのつるぎ
            ["A",186,1], //バリアリング
        ],["W",18, //ダイヤソード
            ["W",14,1], //ミスリルソード
            ["I",96,1], //ダイヤモンド
        ],["W",20, //アストラルソード
            ["W",19,1], //ファルシオン
            ["W",134,1], //スターウィップ
        ],["W",21, //クリスタルソード
            ["I",87,1], //オリハルコン
        //--------暗黒剣----------------------------------------
        ],["W",26, //シャドーブレイド
            ["W",25,1], //あんこくのつるぎ
            ["I",98,2], //のろいのつめ
        ],["W",27, //レイズサーベル
            ["I",84,1], //ダマスカスこう
            ["I",46,1], //ゆうがいぶっしつ
        ],["W",28, //デスブリンガー
            ["W",26,1], //シャドーブレイド
            ["I",101,3], //アーリマンの羽
        ],["W",29, //アベンジャー
            ["W",44,1], //ミスリルセイバー
            ["I",37,1], //つきのカーテン
        ],["W",30, //しっこくのつるぎ
            ["W",25,1], //あんこくのつるぎ
            ["W",5,1], //こだいのつるぎ
            ["I",36,1], //ダークマター
        ],["W",31, //ヴァルハラ
            ["W",30,1], //しっこくのつるぎ
            ["W",49,1], //アポカリプス
        //--------聖剣----------------------------------------
        ],["W",34, //ひかりのつるぎ
            ["I",83,1], //金の塊
            ["W",16,1], //フォースセイバー
        ],["W",35, //セイブザクイーン
            ["W",34,1], //ひかりのつるぎ
            ["W",48,1], //ディフェンダー
        ],["W",36, //エクスカリバー
            ["I",89,1], //アダマンタイト
        ],["W",37, //ライトブリンガー
            ["W",39,1], //ラグナロク
            ["I",102,1], //せいよくしょう,
        ],["W",39, //ラグナロク
            ["W",37,1], //ライトブリンガー
            ["I",91,3], //ませきのかけら
        //--------両手剣----------------------------------------
        ],["W",43, //バスターソード
            ["I",82,1], //鉄の塊
        ],["W",44, //オーガニクス
            ["I",84,1], //ダマスカスこう
        ],["W",45, //ミスリルセイバー
            ["I",85,1], //ミスリル
        ],["W",46, //ハードブレイカー
            ["W",13,1], //ブレイクブレイド
            ["W",45,1], //ミスリルセイバー
        ],["W",47, //ダイヤブレード
            ["W",18,1], //ダイヤソード
            ["I",87,2], //オリハルコン
        ],["W",48, //ディフェンダー
            ["W",46,1], //ハードブレイカー
            ["A",3,1], //ダイヤのたて
        ],["W",287, //ボルケーノスパーダ
            ["W",289,1], //フレイムタン
            ["W",29,1], //アヴェンジャー
            ["W",48,1], //ディフェンダー            
        ],["W",49, //アポカリプス
            ["I",88,1], //ヒヒイロカネ
            ["W",164,1], //ホーリーランス
        //--------ガンブレード----------------------------------------
        ],["W",53, //キアストレート
            ["I",85,1], //ミスリル
        ],["W",54, //カッテングトリガ―
            ["W",9,1], //サラマンドソード
            ["W",101,1], //ホークアイ
        ],["W",289, //フレイムタン
            ["W",9,1], //サラマンドソード
            ["W",54,1], //カッテングトリガー
            ["I",34,3], //かめのこうら
        ],["W",55, //ランスオブスリット
            ["W",159,1], //ミスリルランス
            ["I",40,2], //かりゅうのきば
            ["I",104,1], //きょうりゅうのほね
        ],["W",56, //ヘルタースケルター
            ["W",46,1], //ハードブレイカー
            ["W",91,1], //グラディウス
        ],["W",57, //ハイペリオン
            ["W",51,1], //リボルバー
            ["W",40,1], //ローエングリン
        ],["W",58, //クライム＆ペナルティ
            ["W",55,1], //ランスオブスリット
            ["I",68,1], //ほうちょう
            ["I",48,3], //ほしのかけら
            ["I",34,5], //かめのこうら
        ],["W",59, //ライオンハート
            ["I",89,1], //アダマンタイト
            ["I",35,4], //りゅうのきば
            ["W",274,12], //はどうだん		   
        //--------刀----------------------------------------
        ],["W",62, //きくいちもんじ
            ["I",82,1], //鉄の塊
        ],["W",64, //さすけのかたな
            ["W",61,1], //こてつ
            ["W",86,1], //ソードブレイカー
        ],["W",65, //かぜきりのやいば
            ["W",63,1], //びぜんおさふね
            ["I",31,5], //なんきょくのかぜ
        ],["W",69, //むつのかみ
            ["W",66,1], //むらさめ
            ["I",87,1], //オリハルコン
        ],["W",71, //むらまさ
            ["W",66,1], //むらさめ
            ["W",15,1], //ブラッドソード
            ["W",28,1], //デスブリンガー
            ["I",36,2], //ダークマター
        ],["W",72, //あまのむらくも
            ["I",86,1], //たまはがね
        //--------短剣----------------------------------------
        ],["W",77, //ソウルセイバー
            ["W",16,1], //フォースセイバー
            ["W",80,1], //メイジマッシャー
        ],["W",80, //メイジマッシャー
            ["W",78,1], //ダガー
            ["W",113,1], //まふうじのゆみや
        ],["W",81, //マインゴーシュ
            ["I",82,1], //鉄の塊
        ],["W",82, //ポイズンナイフ
            ["W",78,1], //ダガー
            ["I",114,6], //どくのこな
        ],["W",83, //とうぞくのナイフ
            ["W",79,1], //ジャックナイフ
            ["I",112,1], //クロスボウ
        ],["W",84, //マンイーター
            ["W",79,1], //ジャックナイフ
            ["W",138,1], //ジャベリン
        ],["W",85, //エアナイフ
            ["W",99,1], //えんげつりん
            ["W",139,1], //ウィンドスピア
        ],["W",86, //ソードブレイカー
            ["W",87,1], //ミスリルダガー
            ["A",16,1], //ミスリルシールド
        ],["W",87, //ミスリルダガー
            ["I",85,1], //ミスリル
        ],["W",96, //ルーンダガー
            ["I",84,1],//ダマスカスこう
        ],["W",88, //アサシンダガー
            ["W",87,1], //ミスリルダガー
            ["W",102,1], //スナイパー
            ["W",28,1], //デスブリンガー
        ],["W",89, //アクセルダガー
            ["W",34,1], //グラディウス
            ["I",205,1], //ラピッド
        ],["W",90, //トリトンダガー
            ["W",12,1], //フラタニティ・改
            ["W",157,1], //トライデント
        ],["W",91, //グラディウス
            ["W",34,1], //ひかりのつるぎ
            ["W",211,1], //ホーリーロッド
        ],["W",93, //オリハルコンダガー
            ["I",87,1], //オリハルコン
        ],["W",92, //ゾーリンシェイプ
            ["I",100,3], //まじゅうのほね
            ["W",85,1], //エアナイフ
            ["W",93,1], //オリハルコンダガー
        ],["W",97, //かいとうのナイフ
            ["W",83,1], //とうぞくのナイフ
            ["I",119,2], //にじいろのいと
        //--------投擲----------------------------------------
        ],["W",101, //ホークアイ
            ["I",60,5], //しゅりけん
            ["I",112,3], //だいちょうのはね
            ["W",4,1], //アイアンソード
        ],["W",102, //スナイパー
            ["W",118,1], //ミスリルのゆみや
            ["W",87,1], //ミスリルダガー
        ],["W",103, //ツインヴァイパー
            ["I",61,5], //ふうましゅりけん
            ["W",99,1], //えんげつりん
        ],["W",104, //ウィングエッジ
            ["W",85,1], //エアナイフ
            ["W",101,1], //ホークアイ
        ],["W",105, //ライジングサン
            ["I",88,1], //ヒヒイロカネ
        ],["W",106, //クリスタルクロス
            ["W",21,1], //クリスタルソード
            ["W",93,1], //オリハルコンダガー
        ],["W",107, //おりづる
            ["I",86,1], //たまはがね
            ["I",62,3], //かざぐるま
        ],["W",108, //シューティングスター
            ["I",103,1], //エネルギー結晶
            ["I",19,1], //フェニックスの羽
            ["I",48,5], //ほしのすな
        //--------弓矢----------------------------------------
        ],["W",112, //鉄の弓矢
            ["I",82,1], //鉄の塊
        ],["W",113, //まふうじのゆみや
            ["I",118,5], //ちんもくのこな
            ["W",112,1], //てつのゆみや
        ],["W",114, //ほのおのゆみや
            ["W",118,1], //ミスリルのゆみや
            ["I",30,3], //ボムのかけら
        ],["W",115, //こおりのゆみや
            ["W",118,1], //ミスリルのゆみや
            ["I",31,3], //なんきょくのかぜ
        ],["W",116, //いかづちのゆみや
            ["W",118,1], //ミスリルのゆみや
            ["I",32,3], //サンゴのかけら
        ],["W",117, //ポセイドンのゆみや
            ["W",118,1], //ミスリルのゆみや
            ["I",33,3], //みずのけっしょう
        ],["W",118, //ミスリルのゆみや
            ["I",85,1], //ミスリル
        ],["W",119, //キラーボウ
            ["W",118,1], //ミスリルのゆみや
            ["W",219,1], //オーガキラー
            ["I",46,1], //ゆうがいぶっしつ
        ],["W",277, //ルーンボウ
            ["I",84,1],//ダマスカスこう
        ],["W",120, //ダイヤボウ
            ["I",96,1],//ダイヤモンド
        ],["W",121, //はやてのゆみや
            ["W",116,1], //いかづちのゆみや
            ["W",89,1], //アクセルダガー
        ],["W",122, //エルフィンボウ
            ["W",117,1], //ポセイドンのゆみや
            ["A",186,1], //バリアリング
        ],["W",123, //ようせいのゆみや
            ["W",122,1], //エルフィンボウ
            ["I",87,1], //オリハルコン
        ],["W",124, //よいちのゆみや
            ["I",86,1], //たまはがね
            ["I",100,3], //まじゅうのほね
        ],["W",125, //アルテミスのゆみや
            ["W",124,1], //よいちのゆみや
            ["I",102,1], //せいよくしょう
        //--------ムチ----------------------------------------
        ],["W",127, //チェンウィップ
            ["I",82,1], //鉄の塊
        ],["W",128, //でんげきムチ
            ["W",127,1], //チェンウィップ
            ["I",32,3], //サンゴのかけら
        ],["W",130, //アイスウィップ
            ["W",129,1], //レッドスコルピオン
            ["I",42,1], //ほっきょくのかぜ
        ],["W",278, //ルーンウィップ
            ["I",84,1],//ダマスカスこう
        ],["W",131, //スレイプニルテイル
            ["W",127,1], //チェンウィップ
            ["W",27,1], //レイズサーベル
            ["I",116,1], //ウサギのしっぽ
        ],["W",132, //くじらのひげ
            ["W",131,1], //スレイプニルテイル
            ["I",43,3], //アクアマリン
        ],["W",133, //ファイアビュート
            ["W",129,1], //レッドスコルピオン
            ["W",40,1], //かりゅうのきば
        ],["W",134, //スターウィップ
            ["W",131,1], //スレイプニルテイル
            ["W",210,1], //ほしくずのロッド
        ],["W",136, //りゅうのひげ
            ["W",133,1], //ファイアビュート
            ["W",147,1], //ひりゅうのやり
        //--------軽槍----------------------------------------
        ],["W",138, //ジャベリン
            ["I",82,1], //鉄の塊
        ],["W",139, //ウィンドスピア
            ["W",137,1], //スピア
            ["I",112,1], //だいちょうのはね
        ],["W",140, //ほのおのやり
            ["W",141,1], //ミスリルスピア
            ["I",30,3], //ボムのかけら
        ],["W",142, //ブラッドスピア
            ["W",141,1], //ミスリルスピア
            ["I",113,3], //きゅうけつのきば
            ["I",98,3], //のろいのつめ
        ],["W",141, //ミスリルスピア
            ["I",85,1], //ミスリル
        ],["W",143, //ゴールデンスピア
            ["I",83,1], //金の塊
        ],["W",279, //ルーンスピア
            ["I",84,1],//ダマスカスこう
        ],["W",144, //ダイヤスピア
            ["W",141,1], //ミスリルスピア
            ["I",96,1], //ダイヤモンド
        ],["W",151, // ブリューナク
                ["W",34,1], //ひかりのつるぎ
                ["W",160,1], //ゴールドランス
                ["W",104,1], //ウィングエッジ
        ],["W",145, //クリスタルスピア
            ["I",87,1], //オリハルコン
        ],["W",146, //まじんのやり
            ["W",29,1], //アベンジャー
            ["W",191,1], //ちからのつえ
        ],["W",147, //ひりゅうのやり
            ["W",163,1], //ドラグーンランス
            ["W",176,1], //ドラゴンクロー
        ],["W",148, //ガストロフォーク
            ["W",165,1], //グローランス
            ["I",100,3], //まじゅうのほね
            ["I",184,3], //トード
        ],["W",149, //グングニル
            ["W",131,1], //スレイプニルテイル
            ["W",69,1], //むつのかみ
        ],["W",150, //ビーナスゴスペル
            ["W",164,1], //ホーリーランス
            ["W",194,1], //ひかりのつえ
        //--------重槍----------------------------------------
        ],["W",155, //ヘヴィランス
            ["W",154,1], //スティンガー
            ["W",43,1], //バスターソード
        ],["W",157, //トライデント
            ["W",159,1], //ミスリルランス
            ["I",32,3], //サンゴのかけら
        ],["W",158, //アイスランス
            ["W",159,1], //ミスリルランス
            ["I",31,3], //なんきょくのかぜ
        ],["W",159, //ミスリルランス
            ["I",85,1], //ミスリル
        ],["W",160, //ゴールドランス
            ["I",83,1], //金の塊
        ],["W",280, //ルーンランス
            ["I",84,1],//ダマスカスこう
        ],["W",161, //ダイヤランス
            ["W",159,1], //ミスリルスピア
            ["I",96,1], //ダイヤモンド
        ],["W",162, //クリスタルランス
            ["I",87,1], //オリハルコン
        ],["W",163, //ドラグーンランス
            ["W",145,1], //クリスタルスピア
            ["I",35,5], //りゅうのきば
        ],["W",164, //ホーリーランス
            ["W",90,1], //トリトンダガー
            ["W",151,1], //ブリューナク
            ["W",211,1], //ホーリーロッド
        ],["W",165, //グローランス
            ["I",86,1], //たまはがね
            ["I",94,1], //けんじゃのいし
            ["W",194,1], //ひかりのつえ
        ],["W",166, //ロンギヌス
            ["W",164,1], //ホーリーランス
            ["W",142,1], //ブラッドスピア
            ["I",102,1], //せいよくしょう
        //--------爪----------------------------------------
        ],["W",168, //バーニンナックル
            ["W",174,1], //ミスリルクロー
            ["I",30,3], //ボムのかけら
        ],["W",169, //フリーズクロー
            ["W",174,1], //ミスリルクロー
            ["I",31,3], //なんきょくのかぜ
        ],["W",170, //タイダルナックル
            ["W",174,1], //ミスリルクロー
            ["I",33,3], //みずのけっしょう
        ],["W",171, //いかづちのつめ
            ["W",174,1], //ミスリルクロー
            ["I",32,3], //サンゴのかけら
        ],["W",172, //ダーククロー
            ["I",98,3], //のろいのつめ
            ["I",115,3], //オチューのしょくしゅ
        ],["W",173, //ポイズンクロー
            ["I",98,3], //のろいのつめ
            ["I",114,3], //どくのこな
        ],["W",174, //ミスリルクロー
            ["I",85,1], //ミスリル
        ],["W",175, //ブラッドクロー
            ["I",98,3], //のろいのつめ
            ["I",113,5], //きゅうけつのきば
        ],["W",281, //ルーンのつめ
            ["I",84,1],//ダマスカスこう
        ],["W",176, //ドラゴンクロー
            ["I",104,3], //きょうりゅうのほね
            ["I",35,5], //りゅうのきば
        ],["W",177, //タイガーファング
            ["I",100,3], //まじゅうのほね
            ["W",104,1], //ウィングエッジ
        ],["W",179, //カイザーナックル
            ["I",88,3], //ヒヒイロカネ
        ],["W",180, //バンデッドクロー
            ["W",172,1], //ダーククロー
            ["W",83,1], //とうぞくのナイフ
        //--------杖----------------------------------------
        ],["W",182, //いやしのつえ
            ["W",181,1], //つえ
            ["I",109,5], //いやしのみず
        ],["W",183, //オークスタッフ
            ["W",181,1], //つえ
            ["I",34,1], //かめのこうら
        ],["W",185, //ようせいのつえ
            ["W",181,1], //つえ
            ["I",108,5], //ねむりごな
        ],["W",187, //ゴーレムのつえ
            ["W",186,1], //サイプレスパイル
            ["I",45,3], //だいちのドラム
        ],["W",188, //ミスリルのつえ
            ["I",85,1], //ミスリル
        ],["W",189, //フレイル
            ["W",127,1], //チェンウィップ
            ["W",205,1], //メタルロッド
        ],["W",282, //ルーンスタッフ
            ["I",84,1],//ダマスカスこう
        ],["W",190, //さばきのつえ
            ["W",203,1], //いかづちのロッド
            ["W",65,1], //かぜきりのやいば
        ],["W",191, //ちからのつえ
            ["W",208,1], //グラビティロッド
            ["W",220,1], //ミスリルアクス
        ],["W",192, //はどうのつえ
            ["W",8,1], //ソーサルセイバー
            ["I",50,3], //フレアストーン
        ],["W",193, //けんじゃのつえ
            ["W",190,1], //さばきのつえ
            ["I",94,1], //けんじゃのいし
        ],["W",194, //ひかりのつえ
            ["W",91,1], //グラディウス
            ["I",103,1], //エネルギーけっしょう
        //--------ロッド----------------------------------------
        ],["W",201, //ほのおのロッド
            ["W",206,1], //ミスリルロッド
            ["I",30,3], //ボムのかけら
        ],["W",202, //こおりのロッド
            ["W",206,1], //ミスリルロッド
            ["I",31,3], //なんきょくのかぜ
        ],["W",203, //いかづちのつめ
            ["W",206,1], //ミスリルロッド
            ["I",32,3], //サンゴのかけら
        ],["W",204, //うずしおのロッド
            ["W",206,1], //ミスリルロッド
            ["I",33,3], //みずのけっしょう
        ],["W",205, //メタルロッド
            ["I",82,1], //鉄の塊
        ],["W",206, //ミスリルロッド
            ["I",85,1], //ミスリル
        ],["W",207, //へんげのロッド
            ["W",204,1], //うずしおのロッド
            ["I",14,10], //おとめのキッス
        ],["W",208, //グラビティロッド
            ["W",205,1], //メタルロッド
            ["I",45,3], //だいちのドラム
        ],["W",209, //ウィザードロッド
            ["W",200,1], //まどうしのロッド
            ["I",92,1], //まどうせき
        ],["W",210, //ほしくずのロッド
            ["W",209,1], //ウィザードロッド
            ["I",48,4], //ほしのすな
        ],["W",211, //ホーリーロッド
            ["W",209,1], //ウィザードロッド
            ["I",94,1], //けんじゃのいし
        //--------斧----------------------------------------
        ],["W",215, //バトルアクス
            ["I",82,1], //鉄の塊
        ],["W",216, //トマホーク
            ["W",215,1], //バトルアクス
            ["W",100,1], //ブーメラン
        ],["W",217, //ポイズンアクス
            ["W",215,1], //バトルアクス
            ["I",114,3], //どくのこな
        ],["W",218, //フランシスカ
            ["W",216,1], //トマホーク
            ["W",156,1], //パルチザン
        ],["W",219, //オーガキラー
            ["W",220,1], //ミスリルアクス
            ["W",84,1], //マンイーター
        ],["W",220, //ミスリルアクス
            ["I",85,1], //ミスリル
        ],["W",221, //ブラッドアクス
            ["W",220,1], //ミスリルアクス
            ["I",113,5], //きゅうけつのきば
            ["I",98,3], //のろいのつめ
        ],["W",222, //ルーンアクス
            ["I",84,1], //ダマスカスこう
        ],["W",223, //ゴールドアクス
            ["W",215,1], //バトルアクス
            ["I",83,1], //きんのかたまり
            ["I",110,1], //せいめいのいずみ
        ],["W",224, //クリスタルアクス
            ["I",87,1], //オリハルコン
        ],["W",226, //ギガントアクス
            ["W",219,1], //オーガキラー
            ["W",225,1], //まじんのおの
            ["I",36,3], //ダークマター
        //--------竪琴----------------------------------------
        ],["W",230, //ゆめのたてごと
            ["W",229,1], //ぎんのたてごと
            ["W",185,1], //ようせいのつえ
        ],["W",231, //きんのたてごと
            ["I",83,1], //金の塊
        ],["W",232, //ラミアのたてごと
            ["W",231,1], //きんのたてごと
            ["A",131,1], //ラミアのティアラ
        ],["W",234, //オルフェのたてごと
            ["W",231,1], //きんのたてごと
            ["I",98,5], //のろいのつめ
            ["I",46,1], //ゆうがいぶっしつ
        ],["W",283, //ルーンハープ
            ["I",84,1],//ダマスカスこう
        ],["W",235, //ミューズのたてごと
            ["W",231,1], //きんのたてごと
            ["W",207,1], //へんげのロッド
        ],["W",236, //クリスタルハープ
            ["I",87,1], //オリハルコン
        ],["W",238, //アポロンのハープ  
            ["W",231,1], //きんのたてごと  
            ["W",176,1], //ドラゴンクロー 
        //--------ハンマー----------------------------------------
        ],["W",253, //ウォーハンマー
            ["I",82,1], //てつのかたまり
        ],["W",254, //ミスリルハンマー
            ["I",85,1], //ミスリル
        ],["W",255, //だいちのハンマー
            ["I",45,3], //だいちのドラム
            ["W",253,1], //ウォーハンマー
        ],["W",284, //ルーンハンマー
            ["I",84,1],//ダマスカスこう
        ],["W",256, //トールハンマー
            ["I",41,5], //でんげきちょうのつの
            ["W",254,1], //ミスリルハンマー
        ],["W",257, //トリトンハンマー
            ["I",34,5], //かめのこうら
            ["I",43,3], //アクアマリン
            ["W",190,1], //さばきのつえ
        ],["W",258, //フレアスレッジ
            ["I",89,1], //アダマンタイト
            ["I",50,3], //フレアストーン
            ["I",103,1], //エネルギー結晶
        //--------盾----------------------------------------
        ],["A",3, //ダイアのたて
            ["A",2,1], //バックラー
            ["I",96,1], //ダイヤモンド
        ],["A",4, //イージスのたて
            ["A",18,1], //ひかりのたて
            ["I",94,1], //けんじゃのいし
        ],["A",9, //アイアンシールド
            ["I",82,1], //鉄の塊
        ],["A",10, //フレイムシールド
            ["A",16,1], //ミスリルシールド
            ["I",30,3], //ボムのかけら
        ],["A",11, //アイスシールド
            ["A",16,1], //ミスリルシールド
            ["I",31,3], //なんきょくのかぜ
        ],["A",12, //アクアシールド
            ["A",16,1], //ミスリルシールド
            ["I",33,3], //みずのけっしょう
        ],["A",13, //らいじんのたて
            ["A",16,1], //ミスリルシールド
            ["I",32,3], //サンゴのかけら
        ],["A",14, //ふうじんのたて
            ["A",16,1], //ミスリルシールド
            ["I",112,3], //だいちょうのはね
        ],["A",16, //ミスリルシールド
            ["I",85,1], //ミスリル
        ],["A",17, //ゴールドシールド
            ["I",83,1], //金の塊
        ],["A",19, //ドラゴンシールド
            ["A",10,1], //フレイムシールド
            ["I",97,5], //りゅうのうろこ
        ],["A",21, //クリスタルのたて
            ["I",87,1], //オリハルコン
        ],["A",22, //げんじのたて
            ["I",86,1], //たまはがね
        ],["A",24, //エンドレスロード
            ["A",21,1], //クリスタルのたて
            ["A",90,1], //ローブオブロード
        ],["A",25, //アダマンシールド
            ["I",89,1], //アダマンタイト
        //--------鎧----------------------------------------
        ],["A",30, //アイアンアーマー
            ["I",82,1], //鉄の塊
        ],["A",32, //ミスリルアーマー
            ["I",85,1], //ミスリル
        ],["A",33, //ゴールドアーマー
            ["I",83,1], //金の塊
        ],["A",34, //ダイヤのよろい
            ["A",33,1], //ゴールドアーマー
            ["I",96,1], //ダイヤモンド
        ],["A",35, //ハデスのよろい
            ["A",31,1], //あんこくのよろい   
            ["I",99,2], //サレコウベ
            ["I",101,2], //アーリマンのはね
        ],["A",36, //ドラゴンメイル
            ["A",32,1], //ミスリルメイル
            ["I",30,3], //ボムのかけら
            ["I",97,3], //りゅうのうろこ
        ],["A",37, //ミスリルプレート
            ["A",32,1], //ミスリルメイル
            ["W",43,1], //バスターソード
        ],["A",38, //クリスタルメイル
            ["I",87,1], //オリハルコン
        ],["A",39, //げんじのよろい
            ["I",86,1], //たまはがね
        ],["A",40, //アダマンアーマー
            ["I",89,1], //アダマンタイト
        ],["A",43, //ゾンビメイル
            ["A",36,1], //ドラゴンメイル
            ["W",35,1], //ハデスのよろい
            ["I",100,4], //まじゅうのほね
        //--------服----------------------------------------
        ],["A",46, //てつのむねあて
            ["I",82,1], //鉄の塊
        ],["A",49, //ミスリルのむねあて
            ["I",85,1], //ミスリル
        ],["A",52, //ミスリルベスト
            ["I",85,1], //ミスリル
        ],["A",53, //ちからだすき
            ["A",50,1], //だいちのころも
            ["A",98,1], //ねじりはちまき
        ],["A",54, //ダイヤのむねあて
            ["A",49,1], //ミスリルのむねあて
            ["I",96,1], //ダイヤモンド
        ],["A",55, //くろおびどうぎ
            ["A",47,1], //けんぽうぎ
            ["A",83,1], //くろのローブ
        ],["A",56, //はくしきのガウン
            ["A",48,1], //しじんのふく
            ["A",81,1], //しさいのローブ
        ],["A",57, //デュエルスーツ
            ["A",51,1], //サバイバルベスト
            ["A",53,1], //ちからだすき
        ],["A",58, //しのびのころも
            ["A",51,1], //サバイバルベスト
            ["A",83,1], //くろのローブ
        ],["A",59, //くろしょうぞく
            ["A",55,1], //くろおびどうぎ
            ["A",35,1], //ハデスのよろい
        ],["A",60, //ヴィシュヌベスト
            ["A",56,1], //はくしきのガウン
            ["A",85,1], //ひかりのローブ
        ],["A",61, //ミラージュベスト
            ["A",58,1], //しのびのころも
            ["A",88,1], //レインボーローブ
        ],["A",62, //レッドジャケット
            ["A",36,1], //ドラゴンメイル
            ["A",70,1], //あかいドレス
        ],["A",63, //ブレイブスーツ
            ["A",57,1], //デュエルスーツ
            ["A",103,1], //タイガーマスク
        ],["A",65, //アダマンベスト
            ["I",89,1], //アダマンタイト
        ],["A",66, //しにがみのころも
            ["A",58,1], //しのびのころも
            ["I",99,4], //サレコウベ
        //--------ドレス----------------------------------------
        ],["A",71, //レインボードレス
            ["A",69,1], //ホワイトドレス
            ["I",119,3], //にじいろのいと
        ],["A",72, //プリンセスドレス
            ["A",69,1], //ホワイトドレス
            ["I",106,1], //ピンクのしっぽ
            ["I",96,1], //ダイヤモンド
        ],["A",73, //ミネルバビスチェ
            ["A",38,1], //クリスタルメイル
            ["A",71,1], //レインボードレス
        ],["A",74, //まじょのドレス
            ["I",95,5], //ルビー
            ["A",86,1], //まじんのローブ
            ["I",100,5], //まじゅうのほね
            ["I",93,1], //ロゼッタいし
        ],["A",75, //しゅくじょのドレス
            ["A",87,1], //どうしのローブ
            ["I",102,1], //せいよくしょう
            ["A",60,1], //ヴィシュヌベスト
        ],["A",76, //ピンクアーマー
            ["A",40,1], //アダマンアーマー
            ["I",106,1], //ピンクのしっぽ
        //--------ローブ----------------------------------------
        ],["A",80, //きんしのローブ
            ["I",83,1], //金の塊
        ],["A",82, //フェアリーローブ
            ["A",80,1], //きんしのローブ
            ["I",118,4], //ちんもくのこな
            ["I",43,1], //ほしのすな
        ],["A",85, //ひかりのローブ
            ["A",80,1], //きんしのローブ
            ["A",87,1], //どうしのローブ
        ],["A",86, //まじんのローブ
            ["A",83,1], //くろのローブ
            ["I",50,3], //フレアストーン
        ],["A",87, //どうしのローブ
            ["A",84,1], //しろのローブ
            ["A",126,1], //ねこみみフード
        ],["A",88, //レインボーローブ
            ["A",85,1], //ひかりのローブ
            ["I",119,3], //にじいろのいと
        ],["A",89, //けんじゃのローブ
            ["A",86,1], //まじんのローブ
            ["A",87,1], //どうしのローブ
        ],["A",90, //ローブオブロード
           ["A",60,1], //ヴィシュヌベスト
           ["A",73,1], //ミネルバビスチェ
        ],["A",91, //しにがみのローブ
            ["A",86,1], //まじんのローブ
            ["I",99,4], //サレコウベ
        ],["A",92, //アダマンローブ
            ["I",89,1], //アダマンタイト
        ],["A",93, //ドラゴンローブ
            ["I",97,3], //りゅうのうろこ
            ["A",82,1], //フェアリーローブ
        //--------帽子----------------------------------------
        ],["A",101, //グリーンベレー
            ["A",100,1], //ベレーぼう
            ["A",50,1], //だいちのころも
        ],["A",102, //ヘッドギア
            ["I",82,1], //鉄の塊
        ],["A",104, //ヒュプノクラウン
            ["I",83,1], //金の塊
        ],["A",105, //レッドキャップ
            ["A",101,1], //グリーンベレー
            ["I",95,1], //ルビー
        ],["A",106, //ロイヤルクラウン
            ["A",104,1], //ヒュプノクラウン
            ["A",117,1], //サークレット
            ["I",95,1], //ルビー
        ],["A",108, //うさみみバンド
            ["I",116,2], //ウサギのしっぽ
            ["A",132,1], //きんのかみかざり
            ["A",133,1], //はやてのかんざし
        ],["A",110, //アダマン帽
            ["I",89,1], //アダマンタイト
        //--------魔法帽----------------------------------------
        ],["A",118, //まじゅつしのぼうし
            ["A",115,1], //とんがりぼうし
            ["I",101,1], //アーリマンのはね
        ],["A",119, //だいちのぼうし
            ["A",116,1], //さんかくぼうし
            ["I",45,2], //だいちのドラム
        ],["A",121, //きんしのぼうし
            ["I",83,1], //金の塊
        ],["A",125, //けんじゃのぼうし
            ["A",122,1], //よいぼしのぼうし
            ["A",123,1], //みょうじょうのぼうし
        ],["A",126, //ねこみみフード
            ["A",103,1], //タイガーマスク
            ["A",123,1], //みょうじょうのぼうし
            ["I",83,5], //きんのかたまり
        //--------かみかざり----------------------------------------
        ],["A",132, //きんのかみかざり
            ["I",83,1], //金の塊
        ],["A",133, //はやてのかんざし
            ["W",65,1], //かぜきりのやいば
            ["W",83,1], //とうぞくのナイフ   
        ],["A",135, //ちかいのヴェール
            ["A",63,1], //ブレイブスーツ 
            ["A",134,1], //しんぴのヴェール
        ],["A",136, //ダイヤのかみかざり
            ["I",96,1], //ダイヤモンド
        ],["A",137, //クリスタルのかみかざり
            ["I",87,1], //オリハルコン    
        ],["A",138, //アダマンのかみかざり
            ["I",89,1], //アダマンタイト
        //--------兜----------------------------------------
        ],["A",140, //アイアンヘルム
            ["I",82,1], //鉄の塊
        ],["A",141, //バルピュータヘルム
            ["A",140,2], //アイアンヘルム
        ],["A",143, //ミスリルヘルム
            ["I",85,1], //ミスリル
        ],["A",144, //ゴールドヘルム
            ["I",83,1], //金の塊
        ],["A",145, //ハデスのかぶと
            ["A",142,1], //あんこくのかぶと   
            ["I",99,3], //サレコウベ
        ],["A",146, //ダイヤのかぶと
            ["A",144,1], //ゴールドヘルム   
            ["I",96,1], //ダイヤモンド
        ],["A",148, //ドラゴンヘルム
            ["A",147,1], //グランドヘルム
            ["I",30,3], //ボムのかけら
            ["I",97,2], //りゅうのうろこ
        ],["A",149, //クリスタルヘルム
            ["I",87,1], //オリハルコン
        ],["A",150, //げんじのかぶと
            ["I",86,1], //たまはがね
        ],["A",151, //アダマンヘルム
            ["I",89,1], //アダマンタイト
        //--------小手----------------------------------------
        ],["A",155, //てつのこて
            ["I",82,1], //鉄の塊
        ],["A",159, //しのびのこて
            ["A",154,1], //とうぞくのこて
            ["A",156,1], //あんこくのこて
        ],["A",160, //ミスリルのこて
            ["I",85,1], //ミスリル
        ],["A",162, //ダイヤのこて
            ["I",96,1], //ダイヤモンド
        ],["A",163, //クリスタルのこて
            ["I",87,1], //オリハルコン
        ],["A",161, //ドラゴンのこて
            ["A",160,1], //ミスリルのこて
            ["I",30,2], //ボムのかけら
            ["I",97,2], //りゅうのうろこ
        ],["A",164, //げんじのこて
            ["I",86,1], //たまはがね
        ],["A",165, //アダマンの小手
            ["I",89,1], //アダマンタイト
        //--------アクセサリー----------------------------------------
        ],["A",176, //セーフティビット
            ["A",171,1], //ジュエルリング
            ["A",175,1], //アミュレット
            ["W",239,1], //ロキのたてごと
        ],["A",179, //ミスリルリング
            ["I",85,1], //ミスリル
        ],["A",180, //ハイパーリスト
            ["A",157,1], //きょじんのこて
            ["A",53,1], //ちからだすき
        ],["A",181, //イヤリング
            ["I",91,2], //ませきのかけら
        ],["A",182, //ブレイブリング
            ["W",191,1], //ちからのつえ
            ["W",8,1], //ソーサルセイバー
        ],["A",188, //エルメスのくつ
            ["A",85,1], //ひかりのローブ
            ["I",107,1], //ときのはぐるま
        ],["A",190, //まもりのゆびわ
            ["I",89,1], //アダマンタイト
        ],["A",194, //クリスタルリング
            ["I",87,1], //オリハルコン    
        ],["A",204, //きんのゆびわ
            ["I",83,1], //金の塊
        ],["A",205, //テトラエレメンタル
            ["A",206,1], //ほのおのゆびわ
            ["A",207,1], //マダインのゆびわ
            ["A",208,1], //さんごのゆびわ
            ["A",209,1], //アクアマリンのゆびわ
        ],["A",206, //ほのおのゆびわ
            ["A",204,1], //きんのゆびわ
            ["I",40,1], //かりゅうのきば
        ],["A",207, //マダインのゆびわ
            ["A",204,1], //きんのゆびわ
            ["I",42,1], //ほっきょくのかぜ
        ],["A",208, //さんごのゆびわ
            ["A",204,1], //きんのゆびわ
            ["I",41,1], //でんげきちょうのつの
        ],["A",209, //アクアマリンのゆびわ
            ["A",204,1], //きんのゆびわ
            ["I",43,1], //アクアマリン
        ],["A",210, //てんぐのゆびわ
            ["A",204,1], //きんのゆびわ
            ["I",44,1], //かぜきりば
        ],["A",211, //ふゆうせきのゆびわ
            ["A",210,1], //てんぐのゆびわ
            ["I",36,1], //ダークマター
            ["I",102,1], //せいよくしょう
        ]
    ]
           
}

Game_Party.prototype.getItemRecipe = function(item){
    const allRecipe = this.compositionRecipe();
    var iType;
    if(DataManager.isWeapon(item)){
        iType = "W";
    }else if(DataManager.isArmor(item)){
        iType = "A";
    }else if(DataManager.isItem(item)){
        iType = "I";
    }
    for(recipe of allRecipe){
        if(recipe[0] == iType && item.id == recipe[1]){
            return recipe;
        }
    }
    return [];
}

Game_Party.prototype.getIncludeRecipeItems = function(item){
    const allRecipe = this.compositionRecipe();
    var iType;
    var goods = [];
    if(DataManager.isWeapon(item)){
        iType = "W";
    }else if(DataManager.isArmor(item)){
        iType = "A";
    }else if(DataManager.isItem(item)){
        iType = "I";
    }
    for(recipe of allRecipe){
        for(let i=2;i<recipe.length;i++){
            if(recipe[i][0] == iType && item.id == recipe[i][1]){
                switch(recipe[0]){
                    case "W":
                        goods.push($dataWeapons[recipe[1]]);
                        break;
                    case "A":
                        goods.push($dataArmors[recipe[1]]);
                        break;
                    case "I":
                        goods.push($dataItems[recipe[1]]);
                        break;
                }
            }
        }
    }
    return goods;
}

Game_Party.prototype.isComposibleItem = function(item){
    const recipe = this.getItemRecipe(item);
    
    for(let i=2;i<recipe.length;i++){
        const num = recipe[i][2];
        var material;
        if(recipe[i][0] == "I"){
            material = $dataItems[recipe[i][1]];
        }else if(recipe[i][0] == "W"){
            material = $dataWeapons[recipe[i][1]];
        }else if(recipe[i][0] == "A"){
            material = $dataArmors[recipe[i][1]];
        }
        if($gameParty.numItems(material)<num){
            return false;
        }
    }
    return true;    
}

function Scene_Composition() {
    this.initialize(...arguments);
}

Scene_Composition.prototype = Object.create(Scene_Blacksmith.prototype);
Scene_Composition.prototype.constructor = Scene_Composition;

Scene_Composition.prototype.create = function() {
    Scene_MenuBase.prototype.create.call(this);
    this.createDummyWindow();
    this.createHelpWindow();
    this.createMenuNameWindow();
    this.createStatusWindow();
    this.createTypesWindow();
    //ゴールドウィンドウはない
    //this.createGoldWindow();
    this.createListWindow();
    //コマンドウィンドウはない
    //this.createCommandWindow();
    this.createActorsWindow();
    this._listWindow.setActorsWindow(this._actorsWindow);
    this.createCompositionWindow();
    this.createMaterialsWindow();
    //カテゴリウィンドウは不要
    //this.createCategoryWindow();
    //売却も不要
    //this.createSellWindow();
};

Scene_Composition.prototype.goods = function() {
    if(!this._typesWindow.itemAt(this._typesWindow.index())){
        return [];
    }
    var goods = [];
    const allList = $gameParty.compositionRecipe();
    var list = [];
    switch(this._typesWindow.item()){
        case "item":
            list = allList.filter(recipe => recipe[0] == "I" && recipe[1]<60);
            break;
        case "ninjutsu":
            list = allList.filter(recipe => recipe[0] == "I" && ((recipe[1]>=60 && recipe[1]<=68) || (recipe[1]>=239 && recipe[1]<=240)));
            break;
        case "white":
            list = allList.filter(recipe => recipe[0] == "I" && $dataItems[recipe[1]].iconIndex == 10);
            break;
        case "black":
            list = allList.filter(recipe => recipe[0] == "I" && $dataItems[recipe[1]].iconIndex == 11);
            break;
        case "time":
            list = allList.filter(recipe => recipe[0] == "I" && $dataItems[recipe[1]].iconIndex == 12);
            break;
        case "sword":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 1);
            break;
        case "dark":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 2);
            break;
        case "saint":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 3);
            break;
        case "claymore":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 4);
            break;
        case "gunblade":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 5);
            break;
        case "katana":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 6);
            break;
        case "knife":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 7);
            break;
        case "throw":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 8);
            break;
        case "bow":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 9);
            break;
        case "whip":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 10);
            break;
        case "spire":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 11);
            break;
        case "lance":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 12);
            break;
        case "knuckle":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 13);
            break;
        case "wand":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 14);
            break;
        case "rod":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 15);
            break;
        case "axe":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 16);
            break;
        case "harp":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 18);
            break;
        case "hammer":
            list = allList.filter(recipe => recipe[0] == "W" && $dataWeapons[recipe[1]].wtypeId == 20);
            break;
        case "buckler":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 1);
            break;
        case "shield":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 2);
            break;
        case "armor":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 3);
            break;
        case "croth":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 4);
            break;
        case "dress":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 5);
            break;
        case "robe":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 6);
            break;
        case "cap":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 7);
            break;
        case "magichat":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 8);
            break;
        case "hairband":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 9);
            break;
        case "helmet":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 10);
            break;
        case "bracer":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 11);
            break;
        case "accessory":
            list = allList.filter(recipe => recipe[0] == "A" && $dataArmors[recipe[1]].atypeId == 12);
            break;
            
    }
    for(recipe of list){
        switch(recipe[0]){
            case "I":
                goods.push($dataItems[recipe[1]]);
                break;
            case "W":
                goods.push($dataWeapons[recipe[1]]);
            break;
            case "A":
                goods.push($dataArmors[recipe[1]]);
            break;
        }
    }
    return goods;
};

Scene_Composition.prototype.createMaterialsWindow = function() {
    const rect = this.materialsWindowRect();
    this._materialsWindow = new Window_Materials(rect);
    this.addWindow(this._materialsWindow);
    this._materialsWindow.hide();
    this._listWindow.setMaterialsWindow(this._materialsWindow);
};

Scene_Composition.prototype.materialsWindowRect = function() {
    const wh = $TILE*2.5+$TILE/8*5;
    const wx = this._typesWindow.x;
    const wy = Graphics.boxHeight-wh;
    const ww = this._typesWindow.width;
    return new Rectangle(wx, wy, ww, wh);
};

Scene_Composition.prototype.actorsWindowRect = function() {
    const wx = $TILE*6+$TILE/8*5;
    const ww = Graphics.boxWidth-wx;
    const wy = this._helpWindow.height;
    const wh = Graphics.boxHeight - wy - $TILE*2.5+$TILE/8*5;
    return new Rectangle(wx, wy, ww, wh);
};

Scene_Composition.prototype.createListWindow = function() {
    const rect = this.blacksmithWindowRect();
    this._listWindow = new Window_compositionList(rect,this._typesWindow);
    this._listWindow.setupGoods(this.goods());
    this._listWindow.setHelpWindow(this._helpWindow);
    //this._blacksmithWindow.setStatusWindow(this._statusWindow);
    this._listWindow.setHandler("ok", this.onListOk.bind(this));
    this._listWindow.setHandler("cancel", this.onListCancel.bind(this));
    this._listWindow.setHandler("pageup", this.onListPageup.bind(this));
    this._listWindow.setHandler("pagedown", this.onListPagedown.bind(this));
    this._typesWindow.setBlacksmithWindow(this._listWindow);
    this.addWindow(this._listWindow);
};

Scene_Composition.prototype.onListPageup = function(){
    this._actorsWindow.changePage();
    this._listWindow.activate();
}
Scene_Composition.prototype.onListPagedown = function(){
    this._actorsWindow.changeBackPage();
    this._listWindow.activate();
}

Scene_Composition.prototype.update = function() {
    Scene_Shop.prototype.update.call(this);
    if(this._type != this._typesWindow.itemAt(this._typesWindow.index())){
        this._type = this._typesWindow.itemAt(this._typesWindow.index());
        this._listWindow.setupGoods(this.goods());
    }
};

Scene_Composition.prototype.onCompositionCancel = function() {
    this._listWindow.show();
    this._helpWindow.show();
    this._actorsWindow.show();
    this._typesWindow.show();
    this._materialsWindow.show();
    this._menuNameWindow.hide();
    this._statusWindow.hide();
    this._compositionWindow.deactivate();
    this._compositionWindow.hide();
    this._listWindow.activate();
};

Scene_Composition.prototype.onListCancel = function() {
    this._actorsWindow.hide();
    this._typesWindow.activate();
    this._typesWindow.show();
    this._listWindow.deactivate();
    this._menuNameWindow.show();
    this._materialsWindow.hide();
};

Scene_Composition.prototype.commandMake = function() {
    if(this._compositionWindow.enable()){
        if(this._item.meta.multiMakeComposition){
            const meta = this._item.meta.multiMakeComposition;
            const id = Number(meta.split(',')[0]);
            const amount = Number(meta.split(',')[1]);
            const makeItem = $dataItems[id];
            $gameParty.gainItem(makeItem, amount);
        }else{
            $gameParty.gainItem(this._item, 1);
        }
        const recipe = $gameParty.getItemRecipe(this._item);
        for(let i=2;i<recipe.length;i++){
            var info = recipe[i];
            var material;
            if(info[0] == "I"){
                material = $dataItems[info[1]];
            }else if(info[0] == "W"){
                material = $dataWeapons[info[1]];
            }else if(info[0] == "A"){
                material = $dataArmors[info[1]];
            }
            $gameParty.loseItem(material, info[2]);
        }
        this._listWindow.refresh();
        this._typesWindow.refresh();
        this.onCompositionCancel();
    }else{
        this._compositionWindow.activate();
    }
};

Scene_Composition.prototype.onListOk = function() {
    this._item = this._listWindow.item();
    this._listWindow.hide();
    this._helpWindow.hide();
    this._materialsWindow.hide();
    this._actorsWindow.hide();
    this._typesWindow.hide();
    this._menuNameWindow.show();
    this._statusWindow.show();
    this._statusWindow.setItem(this._item);
    this._compositionWindow.setEnable($gameParty.isComposibleItem(this._item));
    this._compositionWindow.setItem(this._item);
    this._compositionWindow.refresh();
    this._compositionWindow.show();
    this._compositionWindow.activate();
};

Scene_Composition.prototype.onTypesOk = function() {    this._actorsWindow.show();
    this._typesWindow.deactivate();
    this._listWindow.activate();
    this._listWindow.select(0);
    this._menuNameWindow.hide();           
    this._materialsWindow.show();
};

Scene_Composition.prototype.createMenuNameWindow = function(name) {
    const width = this.mainFontSize()*8;
    var rect = new Rectangle(Graphics.boxWidth-width, 0,width,this.mainFontSize()*3.75);
    this._menuNameWindow = new Window_MenuName(rect);
    this._menuNameWindow.drawMenuName("Synthesis");
    this.addWindow(this._menuNameWindow);
};

Scene_Composition.prototype.createTypesWindow = function() {
    const rect = this.typesWindowRect();
    this._typesWindow = new Window_compositionTypes(rect,this._data);
    this._typesWindow.activate();
    this._typesWindow.setHandler("ok", this.onTypesOk.bind(this));
    this._typesWindow.setHandler("cancel", this.popScene.bind(this));
    this.addWindow(this._typesWindow);
};

Scene_Composition.prototype.typesWindowRect = function() {
    const wx = $TILE*6+$TILE/8*5;
    const wy = this._helpWindow.height;
    const ww = Graphics.boxWidth-wx;
    const wh = Graphics.boxHeight-this._helpWindow.height;
    return new Rectangle(wx, wy, ww, wh);
};

function Window_compositionTypes() {
    this.initialize(...arguments);
}

Window_compositionTypes.prototype = Object.create(Window_Minerals.prototype);
Window_compositionTypes.prototype.constructor = Window_compositionTypes;

Window_compositionTypes.prototype.makeItemList = function() {
    this._data = ["item","ninjutsu","white","black","time",
                  "sword","dark","saint","claymore",
                 "gunblade","katana","knife","throw",
                 "bow","whip","spire","lance",
                 "knuckle","wand","rod","axe","harp","hammer",
                 "buckler","shield","armor","croth",
                 "dress","robe","cap","magichat","hairband",
                 "helmet","bracer","accessory"];
};

Window_compositionTypes.prototype.drawAllItems = function() {
    this.contents.clear();
    const topIndex = this.topIndex();
    for (let i = 0; i < this.maxVisibleItems(); i++) {
        const index = topIndex + i;
        const rect = this.itemLineRect(index);
        if (index < this._data.length) {
            this.drawType(index);
        }
    }
};

Window_compositionTypes.prototype.drawType = function(index) {
    const type = this.itemAt(index);
    if (type) {
        const rect = this.itemLineRect(index);
        this.drawTypeName(type, rect.x-$DOT*8, rect.y+$DOT*2, rect.width+$DOT*16);
    }
};

Window_compositionTypes.prototype.drawTypeName = function(type,x,y,width) {
    var text;
    switch(type){
        case "item":
            text = "\\I[2]アイテム"; break;
        case "ninjutsu":
            text = "\\I[5]にんじゅつ"; break;
        case "white":
            text = "\\I[10]しろまほう"; break;
        case "black":
            text = "\\I[11]くろまほう"; break;
        case "time":
            text = "\\I[12]じくう"; break;
        case "sword":
            text = "\\I[16]けん"; break;
        case "dark":
            text = "\\I[17]あんこくけん"; break;
        case "saint":
            text = "\\I[18]せいけん"; break;
        case "claymore":
            text = "\\I[19]りょうてけん"; break;
        case "gunblade":
            text = "\\I[20]ガンブレード"; break;
        case "katana":
            text = "\\I[21]かたな"; break;
        case "knife":
            text = "\\I[22]たんけん"; break;
        case "throw":
            text = "\\I[23]とうてき"; break;
        case "bow":
            text = "\\I[24]ゆみや"; break;
        case "whip":
            text = "\\I[25]ムチ"; break;
        case "spire":
            text = "\\I[26]けいそう"; break;
        case "lance":
            text = "\\I[27]じゅうそう"; break;
        case "knuckle":
            text = "\\I[28]かくとう"; break;
        case "wand":
            text = "\\I[29]つえ"; break;
        case "rod":
            text = "\\I[30]ロッド"; break;
        case "axe":
            text = "\\I[31]おの"; break;
        case "harp":
            text = "\\I[15]たてごと"; break;
        case "hammer":
            text = "\\I[80]ハンマー"; break;
        case  "buckler":
            text = "\\I[32]こがたたて"; break;
        case "shield":
            text = "\\I[33]おおがたたて"; break;
        case "armor":
            text = "\\I[34]よろい"; break;
        case "croth":
            text = "\\I[35]ふく"; break;
        case "dress":
            text = "\\I[36]ドレス"; break;
        case "robe":
            text = "\\I[37]ローブ"; break;
        case "cap":
            text = "\\I[38]ぼうし"; break;
        case "magichat":
            text = "\\I[39]まほうぼう"; break;
        case "hairband":
            text = "\\I[40]かみかざり"; break;
        case "helmet":
            text = "\\I[41]かぶと"; break;
        case "bracer":
            text = "\\I[42]こて"; break;
        case "accessory":
            text = "\\I[43]アクセサリー"; break;
    }
    this.drawTextEx(text, x, y, width);
};

Window_compositionTypes.prototype.maxItems = function() {
    return this._data.length;
}

Window_compositionTypes.prototype.itemRect = function(index) {
    const maxCols = this.maxCols();
    const itemWidth = this.itemWidth();
    const itemHeight = this.itemHeight();
    const colSpacing = 0;
    const rowSpacing = this.rowSpacing();
    const col = index % maxCols;
    const row = Math.floor(index / maxCols);
    const x = col * itemWidth + colSpacing / 2 - this.scrollBaseX();
    const y = row * itemHeight + rowSpacing / 2 - this.scrollBaseY();
    const width = itemWidth - colSpacing;
    const height = itemHeight - rowSpacing;
    return new Rectangle(x, y, width, height);
};

Window_compositionTypes.prototype.drawItem = function(index) {
    const item = this.itemAt(index);
    const rect = this.itemLineRect(index);
    this.drawItemName(item, rect.x, rect.y, rect.width);
};

Window_compositionTypes.prototype.maxCols = function() {
    return 2;
};

Window_compositionTypes.prototype.item = function() {
    return this._data[this.index()];
};

Window_compositionTypes.prototype.itemAt = function(index) {
    return this._data[index];
};

function Window_compositionList() {
    this.initialize(...arguments);
}

Window_compositionList.prototype = Object.create(Window_Blacksmith.prototype);
Window_compositionList.prototype.constructor = Window_compositionList;

Window_compositionList.prototype.initialize = function(rect,typesWindow) {
    Window_ShopBuy.prototype.initialize.call(this, rect);
    this._shopGoods = [];
    this._typesWindow = typesWindow;
};

Window_compositionList.prototype.maxItems = function() {
    return this._shopGoods.length;
};

Window_compositionList.prototype.drawAllItems = function() {
    const topIndex = this.topIndex();
    for (let i = 0; i < this.maxVisibleItems(); i++) {
        const index = topIndex + i;
        if (index < this.maxItems()) {
            this.drawItemBackground(index);
            this.changePaintOpacity($gameParty.isComposibleItem(this.itemAt(index)));
            if($gameParty.isComposibleItem(this.itemAt(index))){
                if($gameParty.numItems(this.itemAt(index)) == 0){
                    this.changeTextColor(ColorManager.textColor(17));
                }else{
                    this.changeTextColor(ColorManager.normalColor());
                }
            }else{
                this.changeTextColor(ColorManager.normalColor());
            }
            
            this.drawItem(index);
        }
    }
};

Window_compositionList.prototype.drawItemName = function(item, x, y, width) {
    if (item) {
        const iconY = y + (this.lineHeight() - ImageManager.iconHeight) / 2;
        const itemWidth = Math.max(0, width);
        this.drawIcon(item.iconIndex, x - this.contents.fontSize/2, iconY);
        this.drawText(item.name, x + this.contents.fontSize, y, itemWidth);
    }
};

Window_compositionList.prototype.isCurrentItemEnabled = function() {
    return this.isEnabled(this._shopGoods[this.index()]);
};

Window_compositionList.prototype.itemRect = function(index) {
    const maxCols = this.maxCols();
    const itemWidth = this.itemWidth();
    const itemHeight = this.itemHeight();
    const colSpacing = this.colSpacing();
    const rowSpacing = this.rowSpacing();
    const col = index % maxCols;
    const row = Math.floor(index / maxCols);
    const x = col * itemWidth + colSpacing / 2 - this.scrollBaseX() + $TILE/4;
    const y = row * itemHeight + rowSpacing / 2 - this.scrollBaseY();
    const width = itemWidth - colSpacing - $TILE/2;
    const height = itemHeight - rowSpacing;
    return new Rectangle(x, y, width, height);
};

Window_compositionList.prototype.updateHelp = function() {
    this.setHelpWindowItem(this.item());
    if (this._statusWindow) {
        this._statusWindow.setItem(this.item());
    }
    if (this._actorsWindow) {
        this._actorsWindow.setItem(this.item());
    }
    if (this._materialsWindow) {
        this._materialsWindow.setItem(this.item());
    }
};

Window_compositionList.prototype.setMaterialsWindow = function(materialsWindow){
    this._materialsWindow = materialsWindow;
}

function Window_Materials() {
    this.initialize(...arguments);
}

Window_Materials.prototype = Object.create(Window_Base.prototype);
Window_Materials.prototype.constructor = Window_Materials;

Window_Materials.prototype.initialize = function(rect) {
    Window_Base.prototype.initialize.call(this, rect);
};

Window_Materials.prototype.setItem = function(item) {
    this.contents.clear();
    this.changeTextColor(ColorManager.systemColor());
    this.drawText("Synthesis Material",0,0,this.innnerWidth);
    const recipe = $gameParty.getItemRecipe(item);
    for(let i=2;i<recipe.length;i++){
        var info = recipe[i];
        var material;
        if(info[0] == "I"){
            material = $dataItems[info[1]];
        }else if(info[0] == "W"){
            material = $dataWeapons[info[1]];
        }else if(info[0] == "A"){
            material = $dataArmors[info[1]];
        }
        this.changePaintOpacity($gameParty.numItems(material)>=info[2]);
        this.drawItemName(material,0,$TILE/2*(i-1),this.innerWidth);
        this.changePaintOpacity(true);
        this.drawText($gameParty.numItems(material)+"/"+info[2],0,$TILE/2*(i-1),this.innerWidth,"right");
    }
};